tutorials/multiform/dynamicRetention/retentionCylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "100";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2000
(
(0.0125865 -0.00461701 1.05827e-19)
(0.0727494 -0.026998 0)
(0.160904 -0.0453399 2.0038e-19)
(0.262848 -0.0602139 8.71321e-20)
(0.370442 -0.0712807 -1.6694e-19)
(0.478589 -0.0781904 -2.1385e-19)
(0.58396 -0.0809845 6.71773e-20)
(0.684717 -0.0795349 0)
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    cylinder
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
