tutorials/multiform/dynamicRetention/retentionCylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2  -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;

    }

    up
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    right
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
